In [28]:
import pandas as pd
import numpy as np

In [2]:
from pandas import Series, DataFrame

In [3]:
obj = pd.Series([1, 2, 3, 4, 5])

In [4]:
obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
obj.values

array([1, 2, 3, 4, 5], dtype=int64)

In [7]:
obj2 = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])

In [8]:
obj2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
obj2[['b', 'd', 'e']]

b    2
d    4
e    5
dtype: int64

In [10]:
sdata = {
    'Utah': 5000,
    'Ohio': 3500,
    'Texas': 7100,
    'Oregon': 1500,
}
obj3 = pd.Series(sdata)

In [11]:
obj3

Utah      5000
Ohio      3500
Texas     7100
Oregon    1500
dtype: int64

In [12]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [13]:
obj4 = pd.Series(sdata, index=states)

In [14]:
obj4

California       NaN
Ohio          3500.0
Oregon        1500.0
Texas         7100.0
dtype: float64

In [15]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

### 注意obj3+obj4之后Utah的值仍为NaN

In [16]:
obj3 + obj4

California        NaN
Ohio           7000.0
Oregon         3000.0
Texas         14200.0
Utah              NaN
dtype: float64

In [17]:
data = {
    'State': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'Year': [2000, 2001, 2002, 2001, 2002, 2003],
    'Pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}
frame = pd.DataFrame(data)

In [18]:
frame

    State  Year  Pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [19]:
pd.DataFrame(data, columns=['Year', 'State', 'Pop'])

   Year   State  Pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [20]:
frame.columns

Index(['State', 'Year', 'Pop'], dtype='object')

In [21]:
frame['State']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: State, dtype: object

In [22]:
frame['Year']

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: Year, dtype: int64

In [23]:
frame['Eastern'] = frame['State'] == 'Ohio'

In [24]:
frame

    State  Year  Pop  Eastern
0    Ohio  2000  1.5     True
1    Ohio  2001  1.7     True
2    Ohio  2002  3.6     True
3  Nevada  2001  2.4    False
4  Nevada  2002  2.9    False
5  Nevada  2003  3.2    False

In [26]:
frame.drop('Year', axis=1)

    State  Pop  Eastern
0    Ohio  1.5     True
1    Ohio  1.7     True
2    Ohio  3.6     True
3  Nevada  2.4    False
4  Nevada  2.9    False
5  Nevada  3.2    False

In [31]:
data = pd.DataFrame(np.arange(16).reshape(4, 4), index=['a', 'b', 'c', 'd'], columns=['Ohio', 'Texas', 'California', 'Alaska'])

In [32]:
data

   Ohio  Texas  California  Alaska
a     0      1           2       3
b     4      5           6       7
c     8      9          10      11
d    12     13          14      15

In [36]:
data.iloc[2]

Ohio           8
Texas          9
California    10
Alaska        11
Name: c, dtype: int32